CSI API ETABS v1
cSelect.GetSelected Method
 Retrieves a list of selected objects
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetSelected(
	ref int NumberItems,
	ref int[] ObjectType,
	ref string[] ObjectName
)
Function GetSelected (
	ByRef NumberItems As Integer,
	ByRef ObjectType As Integer(),
	ByRef ObjectName As String()
) As Integer
Dim instance As cSelect
Dim NumberItems As Integer
Dim ObjectType As Integer()
Dim ObjectName As String()
Dim returnValue As Integer
returnValue = instance.GetSelected(NumberItems,
	ObjectType, ObjectName)
int GetSelected(
	int% NumberItems,
	array<int>^% ObjectType,
	array<String^>^% ObjectName
)
abstract GetSelected :
        NumberItems : int byref *
        ObjectType : int[] byref *
        ObjectName : string[] byref -> int
Parameters
NumberItems
Type: System.Int32
 The number of selected objects
ObjectType
Type: System.Int32[]
 This is an array that includes the object type of each selected object.
Point object
Frame object
Cable object
Tendon object
Area object
Solid object
Link object
ObjectName
Type: System.String[]
 This is an array that includes the name of each selected object
Return Value
Type: Int32
 Returns zero if the selection list is successfully retrieved, otherwise it returns a nonzero value
Remarks
See Also
Reference
cSelect Interface
ETABSv1 Namespace